Revit 2027 API
Surface.GetBoundingBoxUV Method
 Gets the UV bounding box of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxUV GetBoundingBoxUV()
Public Function GetBoundingBoxUV As BoundingBoxUV
public:
BoundingBoxUV^ GetBoundingBoxUV()
member GetBoundingBoxUV : unit -> BoundingBoxUV
Return Value
BoundingBoxUV
 The UV bounding box of the surface.
Remarks
 The UV bounding box may not be set.
See Also
Reference
Surface Class
Autodesk.Revit.DB Namespace